Revit 2024 API
DirectContext3DHandleOverrides Members
The DirectContext3DHandleOverrides type exposes the following members.
Methods
Name | Description
Assign
 Assigns values of the source overrides to this object.
Dispose
Releases all resources used by the DirectContext3DHandleOverrides
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetDirectContext3DHandleSettings
 Gets override settings associated with a DirectContext3D handle instance or type.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsEqual
 Check if the contents of two overrides are equal.
SetDirectContext3DHandleSettings
 Assigns override settings associated with a DirectContext3D handle instance or type.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
DirectContext3DHandleOverrides Class
Autodesk.Revit.DB.DirectContext3D Namespace